export const GAME_TEXT = {
  // 进入游戏确认弹窗
  entryModal: "选择后进入网站的网页解密游戏版本，是否进入",

  // 开场打字机台词
  openingNarration: `你是一个青蛙大学电子系2025级学生，即将迎来自己大学生活的第一个暑假，但你的室友兼一起长大的好友吴务鎏却在放假前便不知所踪，可老师导员们却毫不担心。
真正让你觉得奇怪的是，自己回到老家后，却得知住在隔壁的小吴并未回家，但她的父母也毫不担心。
你感到事情十分奇怪，决定调查好友的去向。`,

  redAlertStage2: "恭喜你来到了第二段旅程！",
  redAlertFinal: "恭喜你来到了最后一段旅程！",

  safeBoxLockTip: "请先办理伸根签证再查看！",
  xiaoDaNoPermit: "算力券耗尽，已为您兑换伸根签证，请登录其它账号",

  // 清小搭彩蛋，点假文物词条（已改为青蛙大学）
  easterEggFakeRelic: "我知道，这不是文物哦！我还知道青蛙大学电子系无56班大一学年获得了甲级团支部~",

  // 网盘悬浮提示 title.html
  diskHoverTip: "提取码也可以是字母，是位移后的我",

  // --------结局吴务鎏台词，取材实践总结文档----------
  endingNarration: `很抱歉一声不响就消失啦。
我被敦煌文化深深吸引，报名参加了E创敦煌iDunhuang海外实践支队，现在正在巴黎IDP中心，很快就要回国。

敦煌遗书流散在世界各地，过去想要完整看见一件文物，需要跨越山海。
国际敦煌项目IDP用数字化的方式，把分散在不同国家机构的文献汇聚到网络上。
我们电子系同学尝试用AI、多模态识别技术，为古籍保护出一份微薄力量。

文明因交流而多彩，文明因互鉴而丰富。数字化不仅仅是拍照存档，它让流散海外的文物实现数字化回归。
技术不止是整合信息，更要传递人文的温度。作为电子信息的学生，我们希望用专业所长守护人类共同的文化记忆。

纵横欧亚，寻脉敦煌。`,

  endingTitle: "完美通关🎉",

  // 无效会话提示 MeChat
  chatDisabledTip: "暂无法查看该会话",
  searchNothingTip: "什么也没有找到",
  xiaoDaLoginHint: "纯字母，不分大小写"
}
